In [ ]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt

In [8]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

In [15]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [20]:
right_table = {'CountryID': [3,4],
              'Country': ['Panama', 'Spain']}

In [21]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   CountryID Country
0          3  Panama
1          4   Spain

In [22]:
inner_joined_df = pd.merge(left_table_df, right_table_df, on='CountryID', how='inner')
inner_joined_df

         Date  CountryID  Units Country
0  03-01-2020          3     30  Panama

In [23]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

In [24]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [25]:
right_table = {'ID': [1,2, 3],
              'Country': ['USA', 'Canada', 'Panama']}

In [26]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama

In [27]:
left_joined_df = pd.merge(left_table_df, right_table_df, left_on='CountryID', right_on='ID', how='left')
left_joined_df

         Date  CountryID  Units   ID Country
0  01-01-2020          1     40  1.0     USA
1  02-01-2020          1     25  1.0     USA
2  03-01-2020          3     30  3.0  Panama
3  04-01-2020          4     35  NaN     NaN

In [28]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,4],
              'Units': [40, 25, 30, 35]}

In [29]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          4     35

In [30]:
right_table = {'CountryID': [3, 5],
              'Country': ['Pandama', 'Russia']}

In [31]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   CountryID  Country
0          3  Pandama
1          5   Russia

In [33]:
right_joinned_merged = pd.merge(left_table_df, right_table_df, on='CountryID', how='right')
right_joinned_merged

         Date  CountryID  Units  Country
0  03-01-2020          3   30.0  Pandama
1         NaN          5    NaN   Russia

In [37]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

In [35]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [38]:
right_table = {'ID': [1,2,3,4],
              'Country': ['USA', 'Canada', 'Panama', 'Spain']}

In [ ]:
right_table_df = pd.DataFrame(right_table)

right_table_df

   ID Country
0   1     USA
1   2  Canada
2   3  Panama
3   4   Spain

In [52]:
full_joined_df = pd.merge(left_table_df, right_table_df, left_on='CountryID', right_on='ID', how='outer').drop('Country',axis=1)
full_joined_df

         Date  CountryID  Units  ID
0  01-01-2020        1.0   40.0   1
1  02-01-2020        1.0   25.0   1
2  04-01-2020        2.0   35.0   2
3  03-01-2020        3.0   30.0   3
4         NaN        NaN    NaN   4

In [45]:
full_joined_df = pd.merge(left_table_df, right_table_df, left_on='CountryID', right_on='ID', how='outer')
full_joined_df

         Date  CountryID  Units  ID Country
0  01-01-2020        1.0   40.0   1     USA
1  02-01-2020        1.0   25.0   1     USA
2  04-01-2020        2.0   35.0   2  Canada
3  03-01-2020        3.0   30.0   3  Panama
4         NaN        NaN    NaN   4   Spain

In [53]:
left_table = {'Date': ['01-01-2020', '02-01-2020', '03-01-2020', '04-01-2020' ],
              'CountryID': [1,1,3,2],
              'Units': [40, 25, 30, 35]}

In [54]:
left_table_df = pd.DataFrame(left_table)
left_table_df

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
2  03-01-2020          3     30
3  04-01-2020          2     35

In [55]:
right_table = {'ID': [3,4],
              'Country': ['Panama', 'Spain']}

In [56]:
right_table_df = pd.DataFrame(right_table)
right_table_df

   ID Country
0   3  Panama
1   4   Spain

In [57]:
left_anti_joined_df = pd.merge(left_table_df, right_table_df, left_on='CountryID', right_on='ID', how='left', indicator=True)
left_anti_joined_df

         Date  CountryID  Units   ID Country     _merge
0  01-01-2020          1     40  NaN     NaN  left_only
1  02-01-2020          1     25  NaN     NaN  left_only
2  03-01-2020          3     30  3.0  Panama       both
3  04-01-2020          2     35  NaN     NaN  left_only

In [58]:
left_anti_joined_df.loc[(left_anti_joined_df['_merge'] == 'left_only'), ['Date', 'CountryID', 'Units']]

         Date  CountryID  Units
0  01-01-2020          1     40
1  02-01-2020          1     25
3  04-01-2020          2     35